<?php
abstract class STATUS_CODE {
	const SUCCESS_NORMAL = 1;
    const SUCCESS_WITH_MULTIPLE_RECORDS = 2;
	const DEFAULT_FAIL = 0;
	const UNSUPPORT_FAIL = -1;
    const FAIL_WITH_LOCAL_NO_RECORD = -2;
}

const CASE_STATUS = array(
    "A" => "初審",
    "B" => "複審",
    "H" => "公告",
    "I" => "補正",
    "R" => "登錄",
    "C" => "校對",
    "U" => "異動完成",
    "F" => "結案",
    "X" => "補正初核",
    "Y" => "駁回初核",
    "J" => "撤回初核",
    "K" => "撤回",
    "Z" => "歸檔",
    "N" => "駁回",
    "L" => "公告初核",
    "E" => "請示",
    "D" => "展期"
);

const REG_NOTE = array(
    "B" => "登錄開始",
    "R" => "登錄完成",
    "C" => "校對結束",
    "E" => "校對有誤",
    "S" => "異動開始",
    "F" => "異動完成",
    "G" => "異動有誤",
    "P" => "競合暫停"
);

const VAL_NOTE = array(
    "0" => "登記移案",
    "B" => "登錄中",
    "R" => "登錄完成",
    "D" => "校對完成",
    "C" => "校對中",
    "E" => "校對有誤",
    "S" => "異動開始",
    "F" => "異動完成",
    "G" => "異動有誤"
);


const OFFICE = array(
    "HA" => "桃園",
    "HB" => "中壢",
    "HC" => "大溪",
    "HD" => "楊梅",
    "HE" => "蘆竹",
    "HF" => "八德",
    "HG" => "平鎮",
    "HH" => "龜山"
);

const REG_WORD = array(
	"HA81" => "桃資登",
	"HA82" => "桃資總",
	"HA83" => "桃資更",
	"HA85" => "桃資速",
	"HA87" => "桃資標",
	"HAB1" => "壢桃登跨",
	"HAC1" => "溪桃登跨",
	"HAD1" => "楊桃登跨",
	"HAE1" => "蘆桃登跨",
	"HAF1" => "德桃登跨",
	"HAG1" => "平桃登跨",
	"HAH1" => "山桃登跨",
	"HBA1" => "桃壢登跨",
	"HCA1" => "桃溪登跨",
	"HDA1" => "桃楊登跨",
	"HEA1" => "桃蘆登跨",
	"HFA1" => "桃德登跨",
	"HGA1" => "桃平登跨",
	"HHA1" => "桃山登跨",
	"HB04" => "壢登",
	"HB06" => "壢速",
	"HFB1" => "壢德登跨",
	"HCB1" => "壢溪登跨",
	"HGB1" => "壢平登跨",
	"HDB1" => "壢楊登跨",
	"HBG1" => "平壢登跨",
	"HBE1" => "蘆壢登跨",
	"HBH1" => "山壢登跨",
	"HEB1" => "蘆壢登跨",
	"HBF1" => "德壢登跨",
	"HB05" => "壢永",
	"HHB1" => "壢山登跨",
	"HBD1" => "楊壢登跨",
	"HBC1" => "溪壢登跨"
);
?>
